In [1]:
import pandas as pd 
import numpy as np 
dados = { 'nome':['Pedro','Maria','Janaina','Wong','Roberto','Marco','Paula'], 
         'cidade':['Porto Alegre','S達o Paulo','Rio de Janeiro','Brasilia','Salvador','Curitiba','Belo Horizonte'], 
         'idade':[14,13,15,16,18,13,14], 
         'nota':[83.0,59.0,86.0,89.0,98.0,61.0,44.0] 
} 
dfAlunos = pd.DataFrame(data=dados) 

print (dfAlunos)

      nome          cidade  idade  nota
0    Pedro    Porto Alegre     14  83.0
1    Maria       S達o Paulo     13  59.0
2  Janaina  Rio de Janeiro     15  86.0
3     Wong        Brasilia     16  89.0
4  Roberto        Salvador     18  98.0
5    Marco        Curitiba     13  61.0
6    Paula  Belo Horizonte     14  44.0

In [2]:
dfAlunos.to_csv("alunos.csv",index=False)

In [3]:
df=pd.read_csv("alunos.csv")

In [4]:
df

      nome          cidade  idade  nota
0    Pedro    Porto Alegre     14  83.0
1    Maria       S達o Paulo     13  59.0
2  Janaina  Rio de Janeiro     15  86.0
3     Wong        Brasilia     16  89.0
4  Roberto        Salvador     18  98.0
5    Marco        Curitiba     13  61.0
6    Paula  Belo Horizonte     14  44.0

In [5]:
dfAlunos.describe()

           idade       nota
count   7.000000   7.000000
mean   14.714286  74.285714
std     1.799471  19.661420
min    13.000000  44.000000
25%    13.500000  60.000000
50%    14.000000  83.000000
75%    15.500000  87.500000
max    18.000000  98.000000

In [6]:
pearson= dfAlunos['idade'].corr(dfAlunos['nota'])

In [7]:
if (pearson> 0.5):
    print('Alunos mais VELHOS tem melhor nota')
elif (pearson< 0.5):
     print ('Alunos mais NOVOS tem melhor nota')
else: 
    print('Nao ha relacao entre idade e nota')

Alunos mais VELHOS tem melhor nota